Revit 2026 API

# DirectShapeReferencingOption Enumeration

---

An enumerated type containing possible referencing options for DirectShapes.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum DirectShapeReferencingOption
```
```vb
Public Enumeration DirectShapeReferencingOption
```
```cpp
public enum class DirectShapeReferencingOption
```
```fsharp
type DirectShapeReferencingOption
```

| Member name | Value | Description |
| --- | --- | --- |
| NotReferenceable | 0 | The associated DirectShape shall not be referenceable. |
| Referenceable | 1 | The associated DirectShape may be dimensioned and/or otherwise referenced. |

#### Reference

Autodesk.Revit.DB Namespace